askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVREA.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVREA.bootloader.BOOTSIZE=0x02
AVREA.bootloader.CODESIZE=0x00
AVREA.bootloader.OSCCFG=0b11110111
AVREA.bootloader.SYSCFG0=0b110{bootloader.updi_bit}{bootloader.reset_bit}0{bootloader.eesave_bit}
AVREA.bootloader.SYSCFG1=0b11111111
AVREA.bootloader.WDTCFG=0b00000000
AVREA.bootloader.bod_lvl=000
AVREA.bootloader.bod_mode=00
AVREA.bootloader.bod_sample=0
AVREA.bootloader.tool=avrdude
AVREA.bootloader.eepupload=
AVREA.bootloader.eesave_bit=1
AVREA.bootloader.reset_bit=10
AVREA.bootloader.updi_bit=1
AVREA.bootloader.programed_type=.with_bootloader
AVREA.build.export_merged_output=true
AVREA.build.text_section_start=.text=0x200
AVREA.build.buildopt=-DNDEBUG
AVREA.build.console_baud=-DCONSOLE_BAUD=9600
AVREA.build.led_pin=-DLED_BUILTIN=PIN_PA7
AVREA.build.macroapi=-DENABLE_MACRO_API
AVREA.build.printf=
AVREA.build.printflt=
AVREA.upload.protocol=arduino
AVREA.upload.speed=115200
AVREA.upload.tool=avrdude
AVREA.menu.01_variant.12.build.board=AVR_AVR64EA48
AVREA.menu.01_variant.12.build.mcu=avr64ea48
AVREA.menu.01_variant.12.build.variant=avr_ea48
AVREA.menu.01_variant.12.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2_p128.x
AVREA.menu.01_variant.12.upload.maximum_data_size=6144
AVREA.menu.01_variant.12.upload.maximum_size=65024
AVREA.menu.01_variant.12=48pin AVR64EA48 (64KiB+6KiB)
AVREA.menu.01_variant.13.build.board=AVR_AVR32EA48
AVREA.menu.01_variant.13.build.mcu=avr32ea48
AVREA.menu.01_variant.13.build.variant=avr_ea48
AVREA.menu.01_variant.13.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p64.x
AVREA.menu.01_variant.13.upload.maximum_data_size=4096
AVREA.menu.01_variant.13.upload.maximum_size=32256
AVREA.menu.01_variant.13=48pin AVR32EA48 (32KiB+4KiB)
AVREA.menu.01_variant.14.build.board=AVR_AVR16EA48
AVREA.menu.01_variant.14.build.mcu=avr16ea48
AVREA.menu.01_variant.14.build.variant=avr_ea48
AVREA.menu.01_variant.14.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p64.x
AVREA.menu.01_variant.14.upload.maximum_data_size=2048
AVREA.menu.01_variant.14.upload.maximum_size=15872
AVREA.menu.01_variant.14=48pin AVR16EA48 (16KiB+2KiB)
AVREA.menu.01_variant.20=-
AVREA.menu.01_variant.22.build.board=AVR_AVR64EA32
AVREA.menu.01_variant.22.build.mcu=avr64ea32
AVREA.menu.01_variant.22.build.variant=avr_ea32
AVREA.menu.01_variant.22.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2_p128.x
AVREA.menu.01_variant.22.upload.maximum_data_size=6144
AVREA.menu.01_variant.22.upload.maximum_size=65024
AVREA.menu.01_variant.22=32pin AVR64EA32 (64KiB+6KiB)
AVREA.menu.01_variant.23.build.board=AVR_AVR32EA32
AVREA.menu.01_variant.23.build.mcu=avr32ea32
AVREA.menu.01_variant.23.build.variant=avr_ea32
AVREA.menu.01_variant.23.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p64.x
AVREA.menu.01_variant.23.upload.maximum_data_size=4096
AVREA.menu.01_variant.23.upload.maximum_size=32256
AVREA.menu.01_variant.23=32pin AVR32EA32 (32KiB+4KiB)
AVREA.menu.01_variant.24.build.board=AVR_AVR16EA32
AVREA.menu.01_variant.24.build.mcu=avr16ea32
AVREA.menu.01_variant.24.build.variant=avr_ea32
AVREA.menu.01_variant.24.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p64.x
AVREA.menu.01_variant.24.upload.maximum_data_size=2048
AVREA.menu.01_variant.24.upload.maximum_size=15872
AVREA.menu.01_variant.24=32pin AVR16EA32 (16KiB+2KiB)
AVREA.menu.01_variant.30=-
AVREA.menu.01_variant.32.build.board=AVR_AVR64EA28
AVREA.menu.01_variant.32.build.mcu=avr64ea28
AVREA.menu.01_variant.32.build.variant=avr_ea28
AVREA.menu.01_variant.32.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2_p128.x
AVREA.menu.01_variant.32.upload.maximum_data_size=6144
AVREA.menu.01_variant.32.upload.maximum_size=65024
AVREA.menu.01_variant.32=28pin AVR64EA28 (64KiB+6KiB)
AVREA.menu.01_variant.33.build.board=AVR_AVR32EA28
AVREA.menu.01_variant.33.build.mcu=avr32ea28
AVREA.menu.01_variant.33.build.variant=avr_ea28
AVREA.menu.01_variant.33.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p64.x
AVREA.menu.01_variant.33.upload.maximum_data_size=4096
AVREA.menu.01_variant.33.upload.maximum_size=32256
AVREA.menu.01_variant.33=28pin AVR32EA28 (32KiB+4KiB)
AVREA.menu.01_variant.34.build.board=AVR_AVR16EA28
AVREA.menu.01_variant.34.build.mcu=avr16ea28
AVREA.menu.01_variant.34.build.variant=avr_ea28
AVREA.menu.01_variant.34.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3_p64.x
AVREA.menu.01_variant.34.upload.maximum_data_size=2048
AVREA.menu.01_variant.34.upload.maximum_size=15872
AVREA.menu.01_variant.34=28pin AVR16EA28 (16KiB+2KiB)
AVREA.menu.03_clock.01_20MHz.bootloader.bod_sample=0
AVREA.menu.03_clock.01_20MHz.build.f_cpu=20000000L
AVREA.menu.03_clock.01_20MHz=Internal 20 MHz
AVREA.menu.03_clock.02_10MHz.bootloader.bod_sample=0
AVREA.menu.03_clock.02_10MHz.build.f_cpu=10000000L
AVREA.menu.03_clock.02_10MHz=Internal 10 MHz
AVREA.menu.03_clock.03_5MHz.bootloader.bod_sample=0
AVREA.menu.03_clock.03_5MHz.build.f_cpu=5000000L
AVREA.menu.03_clock.03_5MHz=Internal 5 MHz
AVREA.menu.03_clock.10=-
AVREA.menu.03_clock.11_16MHz.bootloader.OSCCFG=0b11111111
AVREA.menu.03_clock.11_16MHz.bootloader.bod_sample=0
AVREA.menu.03_clock.11_16MHz.build.f_cpu=16000000L
AVREA.menu.03_clock.11_16MHz=Internal 16 MHz
AVREA.menu.03_clock.12_8MHz.bootloader.OSCCFG=0b11111111
AVREA.menu.03_clock.12_8MHz.bootloader.bod_sample=0
AVREA.menu.03_clock.12_8MHz.build.f_cpu=8000000L
AVREA.menu.03_clock.12_8MHz=Internal 8 MHz
AVREA.menu.03_clock.13_4MHz.bootloader.OSCCFG=0b11111111
AVREA.menu.03_clock.13_4MHz.bootloader.bod_sample=0
AVREA.menu.03_clock.13_4MHz.build.f_cpu=4000000L
AVREA.menu.03_clock.13_4MHz=Internal 4 MHz
AVREA.menu.03_clock.15_1MHz.bootloader.OSCCFG=0b11111111
AVREA.menu.03_clock.15_1MHz.bootloader.bod_sample=0
AVREA.menu.03_clock.15_1MHz.build.f_cpu=1000000L
AVREA.menu.03_clock.15_1MHz=Internal 1 MHz
AVREA.menu.03_clock.20=-
AVREA.menu.03_clock.21_2MHz.bootloader.bod_sample=0
AVREA.menu.03_clock.21_2MHz.build.f_cpu=2000000L
AVREA.menu.03_clock.21_2MHz=Internal 2 MHz
AVREA.menu.03_clock.22_32768Hz.bootloader.bod_sample=1
AVREA.menu.03_clock.22_32768Hz.build.f_cpu=32768
AVREA.menu.03_clock.22_32768Hz=Internal 32.768 kHz (ULP)
AVREA.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
AVREA.menu.11_BODMODE.01_disabled=BOD Disabled
AVREA.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
AVREA.menu.11_BODMODE.02_enabled=BOD Enabled
AVREA.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
AVREA.menu.11_BODMODE.03_sampled=BOD Sampled
AVREA.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
AVREA.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
AVREA.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
AVREA.menu.12_BODLVL.BODLEVEL0=Level 1.75V (default)
AVREA.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
AVREA.menu.12_BODLVL.BODLEVEL1=Level 1.90V
AVREA.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
AVREA.menu.12_BODLVL.BODLEVEL2=Level 2.60V
AVREA.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
AVREA.menu.12_BODLVL.BODLEVEL3=Level 4.30V
AVREA.menu.21_resetpin.01_reset.bootloader.reset_bit=10
AVREA.menu.21_resetpin.01_reset=PF6 pin=Reset
AVREA.menu.21_resetpin.02_gpio.bootloader.reset_bit=00
AVREA.menu.21_resetpin.02_gpio=PF6 pin=GPIO (input only)
AVREA.menu.22_updipin.01_updi.bootloader.updi_bit=1
AVREA.menu.22_updipin.01_updi=PF7 pin=UPDI (default)
AVREA.menu.22_updipin.02_gpio.bootloader.updi_bit=0
AVREA.menu.22_updipin.02_gpio=PF7 pin=GPIO (DANGER:NOT RECOMMENDED)
AVREA.menu.23_eeprom.01_keep.bootloader.eesave_bit=1
AVREA.menu.23_eeprom.01_keep=Save guard "Retained"
AVREA.menu.23_eeprom.02_erase.bootloader.eesave_bit=0
AVREA.menu.23_eeprom.02_erase=Save guard "Erase"
AVREA.menu.23_eeprom.03_replace.bootloader.eepupload={bootloader.eeprom}
AVREA.menu.23_eeprom.03_replace.bootloader.eesave_bit=1
AVREA.menu.23_eeprom.03_replace="Erase" and "Replace"
AVREA.menu.51_buildopt.01_Release=Build Release (default)
AVREA.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
AVREA.menu.51_buildopt.02_Debug1=Build DEBUG=1
AVREA.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
AVREA.menu.51_buildopt.03_Debug2=Build DEBUG=2
AVREA.menu.52_macroapi.01_Enable=Macro API Enable (default)
AVREA.menu.52_macroapi.02_Disable.build.macroapi=
AVREA.menu.52_macroapi.02_Disable=Macro API Disable
AVREA.menu.52_macroapi.03_AllDisable.build.macroapi=
AVREA.menu.52_macroapi.03_AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVREA.menu.52_macroapi.03_AllDisable=Standard Library All Disable
AVREA.menu.53_printf.01_default=default
AVREA.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
AVREA.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVREA.menu.53_printf.02_full=Float Support
AVREA.menu.90_console_baud.01_9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVREA.menu.90_console_baud.01_9600bps=CONSOLE_BAUD=9600 bps (default)
AVREA.menu.90_console_baud.03_38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVREA.menu.90_console_baud.03_38400bps=CONSOLE_BAUD=38400 bps
AVREA.menu.90_console_baud.04_57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVREA.menu.90_console_baud.04_57600bps=CONSOLE_BAUD=57600 bps
AVREA.menu.90_console_baud.05_115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVREA.menu.90_console_baud.05_115200bps=CONSOLE_BAUD=115200 bps
AVREA.menu.90_console_baud.06_230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVREA.menu.90_console_baud.06_230400bps=CONSOLE_BAUD=230400 bps
AVREA.menu.90_console_baud.15_1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVREA.menu.90_console_baud.15_1000000bps=CONSOLE_BAUD=1000000 bps
AVREA.menu.90_console_baud.20=-
AVREA.menu.90_console_baud.21_2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVREA.menu.90_console_baud.21_2400bps=CONSOLE_BAUD=2400 bps (for ULP)
AVREA.menu.95_bootloader.01_UART0_A0_LA7.bootloader.file=hex/boot_avrea_UART0_A0_{upload.speed}_LA7.hex
AVREA.menu.95_bootloader.01_UART0_A0_LA7.build.console_select=-DSerial=Serial0A
AVREA.menu.95_bootloader.01_UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7 (default)
AVREA.menu.95_bootloader.10=-
AVREA.menu.95_bootloader.11_UART2_F0_LA7.bootloader.file=hex/boot_avrea_UART2_F0_{upload.speed}_LA7.hex
AVREA.menu.95_bootloader.11_UART2_F0_LA7.build.console_select=-DSerial=Serial2A
AVREA.menu.95_bootloader.11_UART2_F0_LA7=UART2 TX:PF0 RX:PF1 LED=PA7
AVREA.menu.95_bootloader.23_UART2_F4_LA7.bootloader.file=hex/boot_avrea_UART2_F4_{upload.speed}_LA7.hex
AVREA.menu.95_bootloader.23_UART2_F4_LA7.build.console_select=-DSerial=Serial2B
AVREA.menu.95_bootloader.23_UART2_F4_LA7=UART2 TX:PF4 RX:PF5 LED=PA7 (32/48pin)


